{
  "articles": [
    {
      "title": "My Motivation For Career Change",
      "image": "https://images.unsplash.com/photo-1520792532857-293bd046307a?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2370&q=80",
      "sections": [
        "My journey into web development began with a desire to move from analyzing products to building them - to create the experiences that shape how users behave. Having been part of a product team for several years, I have always admired the developers' inspiration and creativity in their daily work. When I started coding real projects myself, I finally understood that drive - there's something magical about bringing ideas to life, and nothing like that superhero feeling when you finally solve a bug you struggled with for hours, or even days.",
        "The first time I tried coding was during my higher vocational studies in Web Analytics, where we started learning JavaScript, HTML and CSS. I realized coding is actually really fun, but kept going with my career in web analytics. With time I grew into a more technical role where I had more insight in a product team, but felt the need to increase my technical understanding to better communicate with our developers and work more efficiently. I, therefore, set goals to learn more about web development for upskilling in my current role. I began some courses at freeCodeCamp and The Odin Project, and realized that it is what I want to do full-time. In August 2025 I officially started my developer journey with Technigo where I joined their 32-week fast-paced JavaScript Developer Bootcamp.",
        "What I enjoy most about programming is the mix of problem solving, creativity, collaboration, and continuous learning. There's always a new concept to explore, a cleaner way to write something, or a new tool that changes how you think and work. And time after time, you surprise yourself by overcoming new challenges you once thought were impossible. My goal is to keep growing as a developer in a collaborative team where learning never stops, and where the focus is always on building things that truly make sense for users."
      ],
      "tag": "Nov 21th"
    }
  ]
}